Catalogs/DiscountCards.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>DiscountCards</Name>
			<Comment>Magnetic, barcoded and mixed discount cards</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.DiscountCardKinds</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CardCodeBarcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardCodeMagnetic</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Any additional information</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/CardsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>CardsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Magnetic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Barcode</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Mixed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DiscountCards/Forms/ListForm/Ext/Form/Module.bsl
#Region FormEventsHandlers

// Procedure - OnCreateAtServer event handler.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Filter.Property("Owner") Then
		If ValueIsFilled(Parameters.Filter.Owner) Then // It is not necessary to show the "Discount card kind" column.
			CurCardKind = Parameters.Filter.Owner;
			
			Items.Owner.Visible = False;
			Items.CardCodeMagnetic.Visible = CurCardKind.CardType = Enums.CardsTypes.Magnetic
	                                               Or CurCardKind.CardType = Enums.CardsTypes.Mixed;
			Items.CardCodeBarcode.Visible = CurCardKind.CardType = Enums.CardsTypes.Barcode
	                                      Or CurCardKind.CardType = Enums.CardsTypes.Mixed;

		Else // Show all columns.
			Items.Owner.Visible = True;
		EndIf;
	EndIf;
	
EndProcedure

#EndRegion
